# MergedPartHasDisConnectedGeometries Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PartMakerMethodForMergePartFailures..::..MergedPartHasDisConnectedGeometries Property
BuiltInFailures..::..PartMakerMethodForMergePartFailures Class See Also
---
A merged part geometry has dis-connected components.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MergedPartHasDisConnectedGeometries { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MergedPartHasDisConnectedGeometries As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MergedPartHasDisConnectedGeometries {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PartMakerMethodForMergePartFailures Class
Autodesk.Revit.DB Namespace